import React, { Component } from 'react';

class WorkOnlineStoreList extends Component {
    render() {
        return(
            <ul className="ask__improvement__list">
                <li className="ask__improvement__list__inner">
                    <div className="ask__improvement__list__inner-item">
                        1.
                    </div>
                    <div>
                        <h4 className="ask__improvement__list__inner-title">
                            Исследование и разработка стратегии
                        </h4>
                        <div className="ask__improvement__list__inner-item">
                            Мы не верим в существование шаблонного решения,
                            по которому можно будет заказать интернет-магазин для любого бизнеса.
                            Перед началом разработки любого проекта, мы проводим маркетинговое исследование:
                            детальное исследование рынка товаров или услуг; анализ стратегии конкурентов;
                            определяем целевую аудиторию и формируем стратегию для успешного запуска проекта.
                            В конце первого этапа наши маркетологи составят уникальное предложение,
                            которое позволит опередить конкурентов по эффективности и качеству работы интернет-магазина.
                        </div>
                    </div>

                </li>
                <li className="ask__improvement__list__inner">
                    <div className="ask__improvement__list__inner-item">
                        2.
                    </div>
                    <div>
                        <h4 className="ask__improvement__list__inner-title">
                            Разработка дизайна
                        </h4>
                        <div className="ask__improvement__list__inner-item">
                            Второй этап разработки интернет-магазина – дизайн.
                            На основе исследования маркетологов, наши дизайнеры создают прототип,
                            который отвечает задачам бизнеса. После утверждения, создается дизайн удобный для клиентов бизнеса,
                            который выгодно подчеркнет особенности товаров или услуг.
                            При создании, используются фирменные цвета и элементы компании. Осуществляется работы:
                            UX Design, UI Design, Front-end/Верстка.
                            Идет тщательная проработка всех деталей для создания полного образа.
                            Мы успешно реализуем любые нестандартные решения.
                        </div>
                    </div>
                </li>
                <li className="ask__improvement__list__inner">
                    <div className="ask__improvement__list__inner-item">
                        3.
                    </div>
                    <div>
                        <h4 className="ask__improvement__list__inner-title">
                            Программирование
                        </h4>
                        <div className="ask__improvement__list__inner-item">
                            Программистами запускается старт работ по переводу из графического плана (картинка) в статический (формат HTML).
                            Создаются с нуля: главная страница, карточки товаров, формы заказа и прочие элементы интернет-магазина.
                            Идет работа над административной панелью, которая будет выполнять задачи соответствующие техническому заданию.
                            Наша цель – создать стильный и быстрый ресурс. Поэтому этот этап работ занимает больше времени.
                            При написании кода, программисты тщательно проверяют его на наличие ошибок.
                        </div>
                    </div>
                </li>
                <li className="ask__improvement__list__inner">
                    <div className="ask__improvement__list__inner-item">
                        4.
                    </div>
                    <div>
                        <h4 className="ask__improvement__list__inner-title">
                            Подключение сервисов
                        </h4>
                        <div className="ask__improvement__list__inner-item">
                            Для безопасной работы интернет-магазина необходимо подключение сторонних сервисов и услуг:
                            современные системы безопасности, системы (CRM), IP-телефония и пр. Если эти услуги уже есть в брифе,
                            то мы их подключим сразу. Проверим все подключенные сервисы на соответствие, эффективность и работоспособность.
                            При возникновении ситуации, когда заказчик хочет приобрести подключение сервисов позже – есть и такая опция.
                            Вы будете проинформированы нашим менеджером о возможности подключения сторонних сервисов еще на первом этапе.
                        </div>
                    </div>

                </li>
                <li className="ask__improvement__list__inner">
                    <div className="ask__improvement__list__inner-item">
                        5.
                    </div>
                    <div>
                        <h4 className="ask__improvement__list__inner-title">
                            Обеспечение безопасности
                        </h4>
                        <div className="ask__improvement__list__inner-item">
                            Для того чтобы обеспечить безопасность интернет-магазина,
                            необходимо осуществить комплекс работ по его защите:
                            подключить множество сервисов; установить антивирус; протестировать защиту; провести тщательный мониторинг эксплуатации ресурса;
                            определить и устранить „слабые места“. Создать резервные копии и предпринять множество других мер,
                            которые обеспечат защиту от взлома и нападений не только вашего интернет-магазина, но и позитивно повлияют на репутацию Вашего бизнеса в целом.
                        </div>
                    </div>
                </li>
                <li className="ask__improvement__list__inner">
                    <div className="ask__improvement__list__inner-item">
                        6.
                    </div>
                    <div>
                        <h4 className="ask__improvement__list__inner-title">
                            Релиз интернет-магазина и поддержка
                        </h4>
                        <div className="ask__improvement__list__inner-item">
                            На последнем этапе разработки интернет-магазина проводится последнее тестирование,
                            после которого он идет в релиз. Мы обеспечиваем круглосуточную техническую поддержку,
                            проводим мониторинг безопасности и доступности.
                            Наши специалисты готовы осуществить техническую поддержку вашего бизнеса и оказать своевременную помощь 24 часа в сутки, 7 дней в неделю.
                        </div>
                    </div>
                </li>
            </ul>
        )
    }
}
export default WorkOnlineStoreList;